Catalogs/БазисыКонтроляИнвестиционныхДеклараций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>БазисыКонтроляИнвестиционныхДеклараций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеСКД</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПолученияБазы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСКД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/БазисыКонтроляИнвестиционныхДеклараций/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ОбновитьСКДНаСервере(Знач БазисыДляОбновления)
	
	Для каждого Базис Из БазисыДляОбновления Цикл
	
		Базис = Базис.ПолучитьОбъект();
		Базис.ДополнительныеСвойства.Вставить("ПрограммноеОбновление");
		
		СКД = Справочники.БазисыКонтроляИнвестиционныхДеклараций.ПолучитьСКДБазиса(Базис.НаборДанных);
		
		ТекущиеНастройки = Базис.ХранилищеНастроек.Получить();
		Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
		Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
		Компоновщик.ЗагрузитьНастройки(ТекущиеНастройки);
		Компоновщик.Восстановить();
		Для каждого Параметр Из Компоновщик.Настройки.ПараметрыДанных.Элементы Цикл
		
			Если Параметр.Использование = Ложь И Не СКД.Параметры.Найти(Параметр.Параметр) = Неопределено Тогда
				Параметр.Использование = Истина;
			КонецЕсли; 
		
		КонецЦикла; 
		
		Базис.ХранилищеСКД = Новый ХранилищеЗначения(СКД, Новый СжатиеДанных(9));
		Базис.ХранилищеНастроек = Новый ХранилищеЗначения(Компоновщик.ПолучитьНастройки(), Новый СжатиеДанных(9));
		
		Базис.Записать();
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСКДВыделенныхБазисов(Команда)
	ОбновитьСКДНаСервере(Элементы.Список.ВыделенныеСтроки);
КонецПроцедуры
